tap "gittower/tap"
tap "graalvm/tap"
tap "jetbrains/utils"
tap "microsoft/git"
tap "oven-sh/bun"
tap "tw93/tap"
brew "ast-grep"
brew "atuin"
brew "autojump"
brew "bat"
brew "bottom"
brew "btop"
brew "colima", restart_service: :changed
brew "curl"
brew "detekt"
brew "difftastic"
brew "diffutils"
brew "docker"
brew "docker-clean"
brew "docker-compose"
brew "duf"
brew "dust"
brew "eza"
brew "fd"
brew "fswatch"
brew "fx"
brew "fzf"
brew "node"
brew "gemini-cli"
brew "gh"
brew "git"
brew "git-delta"
brew "git-lfs"
brew "git-who"
brew "gitleaks"
brew "glow"
brew "gnupg"
brew "go"
brew "golangci-lint"
brew "gotop"
brew "gradle-completion"
brew "gradle"
brew "graphviz"
brew "gron"
brew "grpc"
brew "grpcurl"
brew "hey"
brew "htop"
brew "httpie"
brew "hurl"
brew "hyperfine"
brew "icdiff"
brew "iperf3"
brew "jenv"
brew "jless"
brew "jq"
brew "just"
brew "kcat"
brew "kdoctor"
brew "kotlin"
brew "kotlin-language-server"
brew "krep"
brew "ktlint"
brew "lazygit"
brew "mackup"
brew "mas"
brew "maven"
brew "maven-completion"
brew "miller"
brew "mise"
brew "ncdu"
brew "oha"
brew "ollama"
brew "ripgrep"
brew "opencode"
brew "pinentry-mac"
brew "procs"
brew "proto"
brew "protoc-gen-grpc-java"
brew "qemu"
brew "rtk"
brew "ruff"
brew "rust"
brew "rustup"
brew "sd"
brew "shellcheck"
brew "shfmt"
brew "smartmontools"
brew "starship"
brew "tailscale"
brew "tealdeer"
brew "tmux"
brew "tokei"
brew "tree"
brew "uv"
brew "wget"
brew "xh"
brew "xsv"
brew "yazi"
brew "yq"
brew "zoxide"
brew "zsh"
brew "zsh-autopair"
brew "zsh-autosuggestions"
brew "zsh-fast-syntax-highlighting"
brew "zsh-git-prompt"
brew "zsh-lovers"
brew "zsh-syntax-highlighting"
brew "zsh-you-should-use"
brew "gittower/tap/git-flow-next"
brew "oven-sh/bun/bun"
cask "antigravity"
cask "appcleaner"
cask "auto-claude"
cask "caffeine"
cask "chatgpt"
cask "claude"
cask "claude-devtools"
cask "codex"
cask "codex-app"
cask "cursor"
cask "eul"
cask "font-cascadia-code"
cask "font-cascadia-mono"
cask "font-comic-mono"
cask "font-comic-neue"
cask "font-comic-sans-ms"
cask "font-courgette"
cask "font-east-sea-dokdo"
cask "font-fira-mono"
cask "font-google-sans-code"
cask "font-goorm-sans"
cask "font-goorm-sans-code"
cask "font-jetbrains-mono"
cask "font-noto-sans-kr"
cask "font-noto-sans-mono"
cask "font-powerline-symbols"
cask "font-ubuntu"
cask "font-ubuntu-mono"
cask "font-ubuntu-sans"
cask "font-ubuntu-sans-mono"
cask "github"
cask "graalvm/tap/graalvm-jdk17"
cask "graalvm/tap/graalvm-jdk21"
cask "graalvm/tap/graalvm-jdk23"
cask "graalvm/tap/graalvm-jdk24"
cask "graalvm/tap/graalvm-jdk25"
cask "iina"
cask "jetbrains-toolbox"
cask "tw93/tap/kakuku"
cask "kotlin-lsp"
cask "kotlin-native"
cask "macs-fan-control"
cask "notion"
cask "obsidian"
cask "ollama-app"
cask "opencode-desktop"
cask "slack"
cask "temurin"
cask "temurin@21"
cask "visual-studio-code"
cask "webull"
cask "zulu@11"
cask "zulu@17"
cask "zulu@21"
cask "zulu@25"
cask "zulu@8"
mas "Blackmagic Disk Speed Test", id: 425264550
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 361285480
mas "Keynote", id: 409183694
mas "Monosnap", id: 540348655
mas "Numbers", id: 361304891
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Pages", id: 361309726
mas "Perplexity", id: 6714467650
mas "Xcode", id: 497799835
mas "카카오톡", id: 869223134
vscode "dineug.vuerd-vscode"
vscode "github.copilot-chat"
vscode "pomdtr.markdown-kroki"
cargo "zeroclaw"
